{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [3, 3], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u000e\u0000\u0000\u0000t\u0000j\u0001|\u0000d\u0004d\u0003\u008d\u0002S\u0000)\u0005N\u00e9\u0002\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000)\u0001\u00da\u0004axis)\u0002r\u0001\u0000\u0000\u0000r\u0002\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u0004mean)\u0001\u00da\u0001x\u00a9\u0000r\u0007\u0000\u0000\u0000\u00fa identifying_dog_breeds_simple.py\u00da\u0016global_average_pooling\u0015\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "function_type": "lambda", "output_shape": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000d\u0001d\u0002\u0085\u0002\u0019\u0000S\u0000)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u000binput_shaper\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa identifying_dog_breeds_simple.py\u00da\u001cglobal_average_pooling_shape\u0018\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape_type": "lambda", "arguments": {}}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 120, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "keras_version": "2.1.0", "backend": "tensorflow"}